index.org
#+Title: Emacs Customizations
#+Author: Δelta Alexander Sharp
#+email: delta@dtmlabs.org
#+startup: content

* Install Straight and Use-Package
#+name: install-straight-use-package
#+begin_src elisp
;; Install straight.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Install use-package
(straight-use-package 'use-package)

;; Configure use-package to use straight.el by default
(use-package straight
  :custom (straight-use-package-by-default t))

(use-package use-package-ensure-system-package
  :ensure t)

(use-package use-package-chords
  :ensure t
  :config (key-chord-mode 1))


#+end_src

#+RESULTS: install-straight-use-package
: t

#+name: disable-package-at-startup
#+begin_src elisp :tangle early-init.el 
;; Disable package.el in favor of straight.el
(setq package-enable-at-startup nil)
#+end_src

* Org
#+name: org
#+begin_src elisp
(use-package org
  :demand t
  :ensure t
  
  :bind (("C-c l" . org-store-link)
	 ("C-c a" . org-agenda)
	 ("C-c c" . org-capture)
	 )
  
  :config
  (require 'org-protocol)
  (setq indent-tabs-mode nil)
  (setq org-src-preserve-indentation t)
  (require 'ob-org)
  )
#+end_src

#+RESULTS: org
: org-capture

* Org Roam
#+name: org-roam
#+begin_src elisp
(use-package org-roam
  :after org
  :init
  (setq org-roam-v2-ack t)
  (setq org-roam-directory "~/agcloud/org-roam")
  
  :config
  (setq org-roam-db-location "~/.emacs.d/org-roam.db")
  (require 'org-roam-protocol)
  (org-roam-setup)
  :bind
  ("C-c n i" . org-roam-node-insert)
  ("C-c n f" . org-roam-node-find)
  ("C-c n l" . org-roam-buffer-toggle)
  ("C-c n d" . org-roam-dailies-capture-today)
  ("C-c n r" . org-roam-node-random)
  )
#+end_src

#+RESULTS: org-roam
: org-roam-node-random

* Helm
#+name: helm
#+begin_src elisp
(use-package helm
  :config
  (helm-mode 1)
  (global-unset-key (kbd "C-x c"))
  :bind
  (
   	   ("M-x" . helm-M-x)
	   ("C-x r b" . helm-filtered-bookmarks)
	   ("C-x C-f" . helm-find-files)
	   ("C-x b". helm-mini)
	   ("M-y" . helm-show-kill-ring)
	   ("C-c h o" . helm-occur)
	   :map helm-command-map
	   ("C-c h" . helm-command-prefix)
	   ("<tab>" . helm-execute-persistent-action)
	   ("C-i" . helm-execute-persistent-action)
	   ("C-z" . helm-select-action))

   )

(use-package helm-bibtex
  :ensure t
  :demand t)
  
#+end_src

#+RESULTS: helm

* Theme
#+name: theme
#+begin_src elisp
(use-package zeno-theme)
#+end_src

* Dashboard
#+name: dashboard
#+begin_src elisp
(use-package dashboard
  :init
  (setq dashboard-banner-logo-title "Emacs")
  (setq dashboard-startup-banner 'logo)
  (setq dashboard-center-content t)

  :config
  (dashboard-setup-startup-hook)
  (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
  )
#+end_src

#+RESULTS: dashboard
: t

* Edit Server
#+name: edit-server
#+begin_src elisp
(use-package edit-server
  :if window-system
  :init
  (add-hook 'after-init-hook 'server-start t)
  (add-hook 'after-init-hook 'edit-server-start t))
#+end_src

* Exec-path-from-shell
#+name: exec-path-from-shell
#+begin_src elisp
(use-package exec-path-from-shell
  :if (memq window-system '(mac ns))
  :ensure t
  :demand t
  :config
  (exec-path-from-shell-initialize))
#+end_src

#+RESULTS: exec-path-from-shell

* PDF Tools
#+name: pdf-tools
#+begin_src elisp
(use-package pdf-tools
  :magic ("%PDF" . pdf-view-mode)
  :config
  (pdf-tools-install :no-query))
#+end_src

