index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-02 Fri 15:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Customizations</title>
<meta name="author" content="Δelta Alexander Sharp" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs Customizations</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orged41f14">1. Install Straight and Use-Package</a></li>
<li><a href="#org0385957">2. Org</a></li>
<li><a href="#org5bad7ab">3. Org Roam</a></li>
<li><a href="#org2e55192">4. Helm</a></li>
<li><a href="#org8e97da5">5. Theme</a></li>
<li><a href="#org3e3e269">6. Dashboard</a></li>
<li><a href="#org2aa76c8">7. Edit Server</a></li>
<li><a href="#orga10f891">8. Exec-path-from-shell</a></li>
<li><a href="#org16bc97b">9. PDF Tools</a></li>
<li><a href="#org8fc6606">10. Nov</a></li>
<li><a href="#org0fee8fb">11. Disable Toolbar</a></li>
<li><a href="#org2ec636e">12. Org Noter</a></li>
<li><a href="#org1f8fdc0">13. Magit</a></li>
<li><a href="#org1882e12">14. Ob-ipython</a></li>
<li><a href="#org28942b1">15. Org-ref</a></li>
<li><a href="#orgc5ae308">16. Org-Flashcards</a></li>
<li><a href="#orgef95254">17. Org-Download</a></li>
<li><a href="#orgaf818c8">18. deft</a></li>
<li><a href="#orgceb292c">19. Elpy</a></li>
<li><a href="#orge37783a">20. EAF</a></li>
<li><a href="#org104ad21">21. Main</a></li>
<li><a href="#org58a86f0">22. References</a></li>
</ul>
</div>
</div>


<div id="outline-container-orged41f14" class="outline-2">
<h2 id="orged41f14"><span class="section-number-2">1.</span> Install Straight and Use-Package</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-elisp" id="org5bbca5a"><span style="color: #6F7181;">;; </span><span style="color: #6F7181;">Install straight.el</span>
(<span style="color: #66D9EF;">defvar</span> <span style="color: #5FCA81;">bootstrap-version</span>)
(<span style="color: #66D9EF;">let</span> ((bootstrap-file
       (expand-file-name <span style="color: #C1CAFF;">"straight/repos/straight.el/bootstrap.el"</span> user-emacs-directory))
      (bootstrap-version 5))
  (<span style="color: #66D9EF;">unless</span> (file-exists-p bootstrap-file)
    (<span style="color: #66D9EF;">with-current-buffer</span>
        (url-retrieve-synchronously
         <span style="color: #C1CAFF;">"https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"</span>
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

<span style="color: #6F7181;">;; </span><span style="color: #6F7181;">Install use-package</span>
(straight-use-package 'use-package)

<span style="color: #6F7181;">;; </span><span style="color: #6F7181;">Configure use-package to use straight.el by default</span>
(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">straight</span>
  <span style="color: #BB98FC;">:custom</span> (straight-use-package-by-default t))

(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">use-package-ensure-system-package</span>
  <span style="color: #BB98FC;">:ensure</span> t)

(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">use-package-chords</span>
  <span style="color: #BB98FC;">:ensure</span> t
  <span style="color: #BB98FC;">:config</span> (key-chord-mode 1))


</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp" id="orgca35ce0"><span style="color: #6F7181;">;; </span><span style="color: #6F7181;">Disable package.el in favor of straight.el</span>
(<span style="color: #66D9EF;">setq</span> package-enable-at-startup nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0385957" class="outline-2">
<h2 id="org0385957"><span class="section-number-2">2.</span> Org</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-elisp" id="org11953be">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">org</span>
  <span style="color: #BB98FC;">:demand</span> t
  <span style="color: #BB98FC;">:ensure</span> t
  
  <span style="color: #BB98FC;">:bind</span> ((<span style="color: #C1CAFF;">"C-c l"</span> . org-store-link)
         (<span style="color: #C1CAFF;">"C-c a"</span> . org-agenda)
         (<span style="color: #C1CAFF;">"C-c c"</span> . org-capture)
         )
  
  <span style="color: #BB98FC;">:config</span>
  (<span style="color: #66D9EF;">require</span> '<span style="color: #A6E22E;">org-protocol</span>)
  (<span style="color: #66D9EF;">setq</span> indent-tabs-mode nil)
  (<span style="color: #66D9EF;">setq</span> org-src-preserve-indentation t)
  (<span style="color: #66D9EF;">require</span> '<span style="color: #A6E22E;">ob-org</span>)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org5bad7ab" class="outline-2">
<h2 id="org5bad7ab"><span class="section-number-2">3.</span> Org Roam</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-elisp" id="org016aaaa">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">org-roam</span>
  <span style="color: #BB98FC;">:after</span> org
  <span style="color: #BB98FC;">:init</span>
  (<span style="color: #66D9EF;">setq</span> org-roam-v2-ack t)
  <span style="color: #BB98FC;">:config</span>
  (<span style="color: #66D9EF;">require</span> '<span style="color: #A6E22E;">org-roam-protocol</span>)
  (org-roam-setup)
  <span style="color: #BB98FC;">:bind</span>
  (<span style="color: #C1CAFF;">"C-c n i"</span> . org-roam-node-insert)
  (<span style="color: #C1CAFF;">"C-c n f"</span> . org-roam-node-find)
  (<span style="color: #C1CAFF;">"C-c n l"</span> . org-roam-buffer-toggle)
  (<span style="color: #C1CAFF;">"C-c n d"</span> . org-roam-dailies-capture-today)
  (<span style="color: #C1CAFF;">"C-c n r"</span> . org-roam-node-random)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e55192" class="outline-2">
<h2 id="org2e55192"><span class="section-number-2">4.</span> Helm</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-elisp" id="org7437c66">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">helm</span>
  <span style="color: #BB98FC;">:config</span>
  (helm-mode 1)
  (global-unset-key (kbd <span style="color: #C1CAFF;">"C-x c"</span>))
  <span style="color: #BB98FC;">:bind</span>
  (
           (<span style="color: #C1CAFF;">"M-x"</span> . helm-M-x)
           (<span style="color: #C1CAFF;">"C-x r b"</span> . helm-filtered-bookmarks)
           (<span style="color: #C1CAFF;">"C-x C-f"</span> . helm-find-files)
           (<span style="color: #C1CAFF;">"C-x b"</span>. helm-mini)
           (<span style="color: #C1CAFF;">"M-y"</span> . helm-show-kill-ring)
           (<span style="color: #C1CAFF;">"C-c h o"</span> . helm-occur)
           <span style="color: #BB98FC;">:map</span> helm-command-map
           (<span style="color: #C1CAFF;">"C-c h"</span> . helm-command-prefix)
           (<span style="color: #C1CAFF;">"&lt;tab&gt;"</span> . helm-execute-persistent-action)
           (<span style="color: #C1CAFF;">"C-i"</span> . helm-execute-persistent-action)
           (<span style="color: #C1CAFF;">"C-z"</span> . helm-select-action))

   )
'
(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">helm-bibtex</span>)
  
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e97da5" class="outline-2">
<h2 id="org8e97da5"><span class="section-number-2">5.</span> Theme</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-elisp" id="org0c73fe6">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">zeno-theme</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3e3e269" class="outline-2">
<h2 id="org3e3e269"><span class="section-number-2">6.</span> Dashboard</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-elisp" id="orged07378">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">dashboard</span>
  <span style="color: #BB98FC;">:init</span>
  (<span style="color: #66D9EF;">setq</span> dashboard-banner-logo-title <span style="color: #C1CAFF;">"Emacs"</span>)
  (<span style="color: #66D9EF;">setq</span> dashboard-startup-banner 'logo)
  (<span style="color: #66D9EF;">setq</span> dashboard-center-content t)

  <span style="color: #BB98FC;">:config</span>
  (dashboard-setup-startup-hook)
  (<span style="color: #66D9EF;">setq</span> initial-buffer-choice (<span style="color: #66D9EF;">lambda</span> () (get-buffer <span style="color: #C1CAFF;">"*dashboard*"</span>)))
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org2aa76c8" class="outline-2">
<h2 id="org2aa76c8"><span class="section-number-2">7.</span> Edit Server</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-elisp" id="org15b9e46">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">edit-server</span>
  <span style="color: #BB98FC;">:if</span> window-system
  <span style="color: #BB98FC;">:init</span>
  (add-hook 'after-init-hook 'server-start t)
  (add-hook 'after-init-hook 'edit-server-start t))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga10f891" class="outline-2">
<h2 id="orga10f891"><span class="section-number-2">8.</span> Exec-path-from-shell</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-elisp" id="orgb8ddeff">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">exec-path-from-shell</span>
  <span style="color: #BB98FC;">:if</span> (memq window-system '(mac ns))
  <span style="color: #BB98FC;">:ensure</span> t
  <span style="color: #BB98FC;">:demand</span> t
  <span style="color: #BB98FC;">:config</span>
  (exec-path-from-shell-initialize))
</pre>
</div>
</div>
</div>

<div id="outline-container-org16bc97b" class="outline-2">
<h2 id="org16bc97b"><span class="section-number-2">9.</span> PDF Tools</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-elisp" id="org787034b">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">pdf-tools</span>
  <span style="color: #BB98FC;">:magic</span> (<span style="color: #C1CAFF;">"%PDF"</span> . pdf-view-mode)
  <span style="color: #BB98FC;">:config</span>
  (pdf-tools-install <span style="color: #BB98FC;">:no-query</span>))
</pre>
</div>
</div>
</div>
