index.org
* Nov
#+begin_src elisp
(use-package nov
  :magic ("%EPUB" . pdf-view-mode)
  :config
  (setq nov-text-width 90)
  (defun my-nov-font-setup ()
    (face-remap-add-relative 'variable-pitch :family "OpenDyslexic"
			     :height 1.0))
  (add-hook 'nov-mode-hook 'my-nov-font-setup)
  )
#+end_src

* Disable Toolbar
#+name: disable-toolbar
#+begin_src elisp
(menu-bar-mode -1)
(tool-bar-mode -1) 
(toggle-scroll-bar -1) 
#+end_src

* Org Noter
#+name: org-noter
#+begin_src elisp
(use-package org-noter
  :after (org pdf-tools nov)
  :config
  (setq org-noter-doc-property-in-notes t)
  )
#+end_src

#+RESULTS: org-noter

* Magit
#+Name: magit
#+begin_src elisp
(use-package magit
  :ensure t)
#+end_src


* Ob-ipython
#+name: ob-ipython
#+begin_src elisp
(use-package ob-ipython
  :after (:all org)
)
#+end_src

#+RESULTS: ob-ipython


* Org-ref
#+name: org-ref
#+begin_src elisp
(use-package org-ref
  :straight (org-ref :type git :host github :repo "jkitchin/org-ref")
  :after (org helm-bibtex)
  :init
  (require 'bibtex)
  (require 'hydra)

  (setq reftex-default-bibliography "~/agcloud/org-roam/references.bib")
  (setq bibtex-autokey-year-length 4
      bibtex-autokey-name-year-separator "-"
      bibtex-autokey-year-title-separator "-"
      bibtex-autokey-titleword-separator "-"
      bibtex-autokey-titlewords 2
      bibtex-autokey-titlewords-stretch 1
      bibtex-autokey-titleword-length 5)

:config
(setq org-ref-bibliography-notes  "~/agcloud/org-roam/index.org"
      org-ref-default-bibliography "~/agcloud/org-roam/references.bib"
      org-ref-pdf-directory "~/agcloud/Books")

(require 'org-ref-helm)

:bind
("C-c r" . org-ref-bibtex-hydra/body)
)
#+end_src

#+RESULTS: org-ref

#+RESULTS:


* Org-Flashcards
#+name: org-fc
#+begin_src elisp
(use-package org-fc
  :straight (org-fc
   :type git :repo "https://git.sr.ht/~l3kn/org-fc"
   :files (:defaults "awk" "demo.org")
   :after (org)
   :custom (org-fc-directories "~/agcloud/org-roam")))
#+end_src

#+RESULTS:

* Org-Download
#+name: org-download
#+begin_src elisp
(use-package org-download
  :config
  (setq org-download-image-dir "~/agcloud/org-roam/media/images")
  ;; Drag-and-drop to `dired`
  (add-hook 'dired-mode-hook 'org-download-enable)
  )
#+end_src

#+RESULTS: org-download
: t

#+RESULTS:
: t

* deft
#+name: deft
#+begin_src elisp
(use-package deft
  :bind ("<f8>" . deft)
  :commands (deft)
  :config (setq deft-directory "~/agcloud/org-roam"
                deft-extensions '("org")
		deft-recursive t
		deft-use-filename-as-title t
		
		))
#+end_src

#+RESULTS: deft
: deft

