index.html

<div id="outline-container-org8fc6606" class="outline-2">
<h2 id="org8fc6606"><span class="section-number-2">10.</span> Nov</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">nov</span>
  <span style="color: #BB98FC;">:magic</span> (<span style="color: #C1CAFF;">"%EPUB"</span> . pdf-view-mode)
  <span style="color: #BB98FC;">:config</span>
  (<span style="color: #66D9EF;">setq</span> nov-text-width 90)
  (<span style="color: #66D9EF;">defun</span> <span style="color: #84B5FF;">my-nov-font-setup</span> ()
    (face-remap-add-relative 'variable-pitch <span style="color: #BB98FC;">:family</span> <span style="color: #C1CAFF;">"OpenDyslexic"</span>
                             <span style="color: #BB98FC;">:height</span> 1.0))
  (add-hook 'nov-mode-hook 'my-nov-font-setup)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org0fee8fb" class="outline-2">
<h2 id="org0fee8fb"><span class="section-number-2">11.</span> Disable Toolbar</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">
<pre class="src src-elisp" id="org79fcd53">(menu-bar-mode -1)
(tool-bar-mode -1) 
(toggle-scroll-bar -1) 
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ec636e" class="outline-2">
<h2 id="org2ec636e"><span class="section-number-2">12.</span> Org Noter</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-elisp" id="orgaa663d9">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">org-noter</span>
  <span style="color: #BB98FC;">:config</span>
  (<span style="color: #66D9EF;">setq</span> org-noter-doc-property-in-notes t)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f8fdc0" class="outline-2">
<h2 id="org1f8fdc0"><span class="section-number-2">13.</span> Magit</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre class="src src-elisp" id="orgd046d3e">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">magit</span>
  <span style="color: #BB98FC;">:ensure</span> t)
</pre>
</div>
</div>
</div>


<div id="outline-container-org1882e12" class="outline-2">
<h2 id="org1882e12"><span class="section-number-2">14.</span> Ob-ipython</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">
<pre class="src src-elisp" id="org343f211">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">ob-ipython</span>
  <span style="color: #BB98FC;">:after</span> (<span style="color: #BB98FC;">:all</span> org elpy python)
)
</pre>
</div>
</div>
</div>


<div id="outline-container-org28942b1" class="outline-2">
<h2 id="org28942b1"><span class="section-number-2">15.</span> Org-ref</h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">
<pre class="src src-elisp" id="orge64aa19">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">org-ref</span>
  <span style="color: #BB98FC;">:straight</span> (org-ref <span style="color: #BB98FC;">:type</span> git <span style="color: #BB98FC;">:host</span> github <span style="color: #BB98FC;">:repo</span> <span style="color: #C1CAFF;">"jkitchin/org-ref"</span>)
  <span style="color: #BB98FC;">:after</span> (org)
  <span style="color: #BB98FC;">:init</span>
  (<span style="color: #66D9EF;">require</span> '<span style="color: #A6E22E;">bibtex</span>)
  (<span style="color: #66D9EF;">require</span> '<span style="color: #A6E22E;">hydra</span>)

  (<span style="color: #66D9EF;">setq</span> reftex-default-bibliography <span style="color: #C1CAFF;">"~/agcloud/org-roam/references.bib"</span>)
  (<span style="color: #66D9EF;">setq</span> bibtex-autokey-year-length 4
      bibtex-autokey-name-year-separator <span style="color: #C1CAFF;">"-"</span>
      bibtex-autokey-year-title-separator <span style="color: #C1CAFF;">"-"</span>
      bibtex-autokey-titleword-separator <span style="color: #C1CAFF;">"-"</span>
      bibtex-autokey-titlewords 2
      bibtex-autokey-titlewords-stretch 1
      bibtex-autokey-titleword-length 5)

<span style="color: #BB98FC;">:config</span>
(<span style="color: #66D9EF;">setq</span> org-ref-bibliography-notes  <span style="color: #C1CAFF;">"~/agcloud/org-roam/index.org"</span>
      org-ref-default-bibliography <span style="color: #C1CAFF;">"~/agcloud/org-roam/references.bib"</span>
      org-ref-pdf-directory <span style="color: #C1CAFF;">"~/agcloud/Books"</span>)

(<span style="color: #66D9EF;">require</span> '<span style="color: #A6E22E;">org-ref-helm</span>)

<span style="color: #BB98FC;">:bind</span>
(<span style="color: #C1CAFF;">"C-c r"</span> . org-ref-bibtex-hydra/body)
)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc5ae308" class="outline-2">
<h2 id="orgc5ae308"><span class="section-number-2">16.</span> Org-Flashcards</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">
<pre class="src src-elisp" id="org54cab9f">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">org-fc</span>
  <span style="color: #BB98FC;">:straight</span> (org-fc
   <span style="color: #BB98FC;">:type</span> git <span style="color: #BB98FC;">:repo</span> <span style="color: #C1CAFF;">"https://git.sr.ht/~l3kn/org-fc"</span>
   <span style="color: #BB98FC;">:files</span> (<span style="color: #BB98FC;">:defaults</span> <span style="color: #C1CAFF;">"awk"</span> <span style="color: #C1CAFF;">"demo.org"</span>)
   <span style="color: #BB98FC;">:after</span> (org)
   <span style="color: #BB98FC;">:custom</span> (org-fc-directories <span style="color: #C1CAFF;">"~/agcloud/org-roam"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef95254" class="outline-2">
<h2 id="orgef95254"><span class="section-number-2">17.</span> Org-Download</h2>
<div class="outline-text-2" id="text-17">
<div class="org-src-container">
<pre class="src src-elisp" id="orgb6e8c7a">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">org-download</span>
  <span style="color: #BB98FC;">:config</span>
  (<span style="color: #66D9EF;">setq</span> org-download-image-dir <span style="color: #C1CAFF;">"~/agcloud/org-roam/media/images"</span>)
  <span style="color: #6F7181;">;; </span><span style="color: #6F7181;">Drag-and-drop to `dired`</span>
  (add-hook 'dired-mode-hook 'org-download-enable)
  )
</pre>
</div>

<pre class="example">
t
</pre>
</div>
</div>

<div id="outline-container-orgaf818c8" class="outline-2">
<h2 id="orgaf818c8"><span class="section-number-2">18.</span> deft</h2>
<div class="outline-text-2" id="text-18">
<div class="org-src-container">
<pre class="src src-elisp" id="orgfdf2ab2">(<span style="color: #66D9EF;">use-package</span> <span style="color: #A6E22E;">deft</span>
  <span style="color: #BB98FC;">:bind</span> (<span style="color: #C1CAFF;">"&lt;f8&gt;"</span> . deft)
  <span style="color: #BB98FC;">:commands</span> (deft)
  <span style="color: #BB98FC;">:config</span> (<span style="color: #66D9EF;">setq</span> deft-directory <span style="color: #C1CAFF;">"~/agcloud/org-roam"</span>
                deft-extensions '(<span style="color: #C1CAFF;">"org"</span>)
                deft-recursive t
                deft-use-filename-as-title t
                
                ))
</pre>
</div>
</div>
</div>
