index.org
* EAF
#+name: eaf
#+begin_src emacs-lisp
(use-package eaf
  :straight nil
  :load-path "~/.emacs.d/site-lisp/emacs-application-framework"
  :custom
  ; See https://github.com/emacs-eaf/emacs-application-framework/wiki/Customization
  (eaf-browser-continue-where-left-off t)
  (eaf-browser-enable-adblocker t)
  (browse-url-browser-function 'eaf-open-browser)
  :init
  (require 'eaf)
  (require 'eaf-browser)
  (require 'eaf-pdf-viewer)
  (require 'eaf-camera)
  (require 'eaf-terminal)
  :config
  (defalias 'browse-web #'eaf-open-browser)
  (eaf-bind-key scroll_up "C-n" eaf-pdf-viewer-keybinding)
  (eaf-bind-key scroll_down "C-p" eaf-pdf-viewer-keybinding)
  (eaf-bind-key take_photo "p" eaf-camera-keybinding)
  (eaf-bind-key nil "M-q" eaf-browser-keybinding)) ;; unbind, see more in the Wiki
#+end_src

#+RESULTS: eaf
: t

#+RESULTS:
: t

* Main
#+begin_src elisp :noweb yes :tangle init.el
<<install-straight-use-package>>

<<org>>

<<org-roam>>

<<org-noter>>

<<helm>>

<<theme>>

<<dashboard>>

<<exec-path-from-shell>>

<<edit-server>>

<<pdf-tools>>

<<nov>>

(defalias 'yes-or-no-p 'y-or-n-p) ;;Ease of use

<<disable-toolbar>>

<<deft>>

<<org-fc>>

<<org-download>>

<<magit>>

<<org-ref>>

<<elpy>>

<<ob-ipython>>

<<eaf>>
#+end_src

#+RESULTS:
: t

#+begin_src ipython :session :results output    
print("Hello world")
#+end_src


* References
https://jeffkreeftmeijer.com/emacs-straight-use-package/
https://github.com/jwiegley/use-package
https://github.com/radian-software/straight.el
