index.html
  <span style="color: #BB98FC;">:load-path</span> <span style="color: #C1CAFF;">"~/.emacs.d/site-lisp/emacs-application-framework"</span>
  <span style="color: #BB98FC;">:custom</span>
  <span style="color: #6F7181;">; </span><span style="color: #6F7181;">See https://github.com/emacs-eaf/emacs-application-framework/wiki/Customization</span>
  (eaf-browser-continue-where-left-off t)
  (eaf-browser-enable-adblocker t)
  (browse-url-browser-function 'eaf-open-browser)
  <span style="color: #BB98FC;">:init</span>
  (<span style="color: #66D9EF;">require</span> '<span style="color: #A6E22E;">eaf</span>)
  (<span style="color: #66D9EF;">require</span> '<span style="color: #A6E22E;">eaf-browser</span>)
  (<span style="color: #66D9EF;">require</span> '<span style="color: #A6E22E;">eaf-pdf-viewer</span>)
  (<span style="color: #66D9EF;">require</span> '<span style="color: #A6E22E;">eaf-camera</span>)
  (<span style="color: #66D9EF;">require</span> '<span style="color: #A6E22E;">eaf-terminal</span>)
  <span style="color: #BB98FC;">:config</span>
  (<span style="color: #66D9EF;">defalias</span> '<span style="color: #84B5FF;">browse-web</span> #'eaf-open-browser)
  (<span style="color: #66D9EF;">eaf-bind-key</span> scroll_up <span style="color: #C1CAFF;">"C-n"</span> eaf-pdf-viewer-keybinding)
  (<span style="color: #66D9EF;">eaf-bind-key</span> scroll_down <span style="color: #C1CAFF;">"C-p"</span> eaf-pdf-viewer-keybinding)
  (<span style="color: #66D9EF;">eaf-bind-key</span> take_photo <span style="color: #C1CAFF;">"p"</span> eaf-camera-keybinding)
  (<span style="color: #66D9EF;">eaf-bind-key</span> nil <span style="color: #C1CAFF;">"M-q"</span> eaf-browser-keybinding)) <span style="color: #6F7181;">;; </span><span style="color: #6F7181;">unbind, see more in the Wiki</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython">print("Hello world")
</pre>
</div>
</div>
</div>


<div id="outline-container-org58a86f0" class="outline-2">
<h2 id="org58a86f0"><span class="section-number-2">22.</span> References</h2>
<div class="outline-text-2" id="text-22">
<p>
<a href="https://jeffkreeftmeijer.com/emacs-straight-use-package/">https://jeffkreeftmeijer.com/emacs-straight-use-package/</a>
<a href="https://github.com/jwiegley/use-package">https://github.com/jwiegley/use-package</a>
<a href="https://github.com/radian-software/straight.el">https://github.com/radian-software/straight.el</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Δelta Alexander Sharp</p>
<p class="date">Created: 2022-09-02 Fri 15:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
